In [2]:
from numpy import nan as NA
import pandas as pd
data = pd.Series([1,NA,3.5,NA,7])
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [6]:
data = pd.DataFrame([[1.,6.5,3.],[1.,NA,NA],
                     [NA,NA,NA],[NA,6.5,3.]
])
cleaned = data.dropna(how='all')
cleaned

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [9]:
data[4] = NA
data.dropna(axis=1,how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [12]:
import numpy as np
df = pd.DataFrame(np.random.randn(7,3))
df.iloc[:4,1] = NA
df.iloc[:2,2] = NA
df

          0         1         2
0 -0.345147       NaN       NaN
1 -0.946897       NaN       NaN
2 -0.202289       NaN  0.788508
3  0.420712       NaN -0.741492
4 -0.546599 -0.712367 -2.216837
5  0.698211 -0.854189  2.179682
6 -0.733954  2.020277 -1.160738

In [13]:
df.dropna(thresh=2)

          0         1         2
2 -0.202289       NaN  0.788508
3  0.420712       NaN -0.741492
4 -0.546599 -0.712367 -2.216837
5  0.698211 -0.854189  2.179682
6 -0.733954  2.020277 -1.160738

In [14]:
# 填充缺失数据
df.fillna(0)

          0         1         2
0 -0.345147  0.000000  0.000000
1 -0.946897  0.000000  0.000000
2 -0.202289  0.000000  0.788508
3  0.420712  0.000000 -0.741492
4 -0.546599 -0.712367 -2.216837
5  0.698211 -0.854189  2.179682
6 -0.733954  2.020277 -1.160738

In [15]:
df.fillna({1:0.5,2:0})

          0         1         2
0 -0.345147  0.500000  0.000000
1 -0.946897  0.500000  0.000000
2 -0.202289  0.500000  0.788508
3  0.420712  0.500000 -0.741492
4 -0.546599 -0.712367 -2.216837
5  0.698211 -0.854189  2.179682
6 -0.733954  2.020277 -1.160738

In [16]:
data = pd.Series([1.,NA,3.5,NA,7])
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

In [19]:
data = pd.DataFrame({'k1':['one','two']*3+['two'],'k2':[1,1,2,3,3,4,4]})
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [20]:
data['v1'] = range(7)
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [22]:
data = pd.Series([1.,-999.,2.,-999.,-1000.,3.])
data.replace(-999,np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [24]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]
bins = [18, 25, 35, 60, 100]
cats = pd.cut(ages, bins)
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [ ]:
data = pd.DataFrame(np.random.randn(1000, 4))
data

In [ ]:
df = pd.DataFrame(np.arrange(5*4).reshape((5,4)))
sampler = np.random.permutation()